In [68]:
import pandas as pd

dataframe = pd.DataFrame(["1; 2    23",

"11213; Something    Sothing Elisse",

"144141; Something_2    Something Else",

"40; Something_2    Somethink Else",

"80; Something_2    Somepenguin Else"], columns=['row'])

In [69]:
dataframe.head()

                                     row
0                             1; 2    23
1     11213; Something    Sothing Elisse
2  144141; Something_2    Something Else
3      40; Something_2    Somethink Else
4    80; Something_2    Somepenguin Else

In [70]:
splitted = dataframe["row"].str.split(";", n = 1, expand = True)
dataframe["Column_1"], dataframe["Column_2"] = splitted[0], splitted[1]
dataframe.drop(columns = ["row"], inplace = True)

In [71]:
dataframe.head()

  Column_1                          Column_2
0        1                           2    23
1    11213       Something    Sothing Elisse
2   144141     Something_2    Something Else
3       40     Something_2    Somethink Else
4       80   Something_2    Somepenguin Else

In [72]:
dataframe['Column_1'] = list(map(int, dataframe['Column_1']))
df_a = dataframe.sort_values(by=['Column_1'])
df_a

   Column_1                          Column_2
0         1                           2    23
3        40     Something_2    Somethink Else
4        80   Something_2    Somepenguin Else
1     11213       Something    Sothing Elisse
2    144141     Something_2    Something Else

In [73]:
df_b = dataframe.sort_values(by=['Column_2'], ascending=False)
df_b

   Column_1                          Column_2
3        40     Something_2    Somethink Else
2    144141     Something_2    Something Else
4        80   Something_2    Somepenguin Else
1     11213       Something    Sothing Elisse
0         1                           2    23

In [44]:
#!pip install python-Levenshtein
from Levenshtein import distance

In [74]:
dataframe['Levenshtein'] = list(map(lambda x: distance(x, 'Anything else'), dataframe['Column_2']))
df_c =  dataframe.sort_values(by=['Levenshtein'])
df_c

   Column_1                          Column_2  Levenshtein
0         1                           2    23           12
1     11213       Something    Sothing Elisse           18
2    144141     Something_2    Something Else           20
3        40     Something_2    Somethink Else           20
4        80   Something_2    Somepenguin Else           22

In [96]:
dataframe.loc[dataframe['Levenshtein'] > 2,'Column_2'] = list(map(lambda x:
                                                               x.replace("Something","Who knows"), dataframe['Column_2']))

In [97]:
dataframe

   Column_1                          Column_2  Levenshtein
0         1                           2    23           12
1     11213       Who knows    Sothing Elisse           18
2    144141     Who knows_2    Who knows Else           20
3        40     Who knows_2    Somethink Else           20
4        80   Who knows_2    Somepenguin Else           22